rreicher/PNucleoWB55_Thread/Thread_Coap_Generic/STM32_WPAN/App/app_thread.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
  * File Name          : App/app_thread.c
  * Description        : Thread Application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  *
  * APP_TRHEAD State Machine API:
  * APP_THREAD_SendCoapMsg()
  *    --> Send Non-Confirmable Put Request. Called by EXTI Interrupt
  *              APP_THREAD_CoapSendRequest(&OT_Ressource,
  *                            OT_COAP_TYPE_NON_CONFIRMABLE,
  *                            OT_COAP_CODE_PUT,
  *                            MULICAST_FTD_MED,
  *                            NULL,
  *                            PayloadWrite,
  *                            sizeof(PayloadWrite),
  *                            NULL,
  *                            NULL);
  *
  * --> Start Timer Single Shot Timeout to 5s
  *  --> Wait Timer Event after timeout
  *  --> Send Confirmable Put Request.
  *              APP_THREAD_CoapSendRequest(&OT_Ressource,
  *                            OT_COAP_TYPE_CONFIRMABLE,
  *                            OT_COAP_CODE_PUT,
  *                            MULICAST_FTD_MED,
  *                            NULL,
  *                            PayloadWrite,
  *                            sizeof(PayloadWrite),
  *                            APP_THREAD_CoapDataRespHandler,
  *                            NULL);
  *
  * APP_THREAD_CoapSendRequest()
  *  --> Configure Coap message with specifed parameters and send it
  *  --> Send PayloadWrite[] buffer contains
  *
  *
  * APP_THREAD_CoapRequestHandler()
  *  --> Handler called when server receive a Coap Request
  *  --> Read pMessage and write it to PayloadRead[]
  *  --> If received message Mode is Confirmable, then send response
  *              APP_THREAD_CoapSendDataResponse()
  *
  *
  * APP_THREAD_CoapSendDataResponse()
  *  --> Function acknowledge back to sender with same message
  *
  * APP_THREAD_CoapDataRespHandler()
  *  --> Handler called to manage response
  *  --> Simply test and printf if NO_ERROR case
  *
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "app_common.h"
#include "utilities_common.h"
#include "app_entry.h"
#include "dbg_trace.h"
#include "app_thread.h"
#include "stm32wbxx_core_interface_def.h"
#include "openthread_api_wb.h"
#include "shci.h"
#include "stm_logging.h"
#include "app_conf.h"
#include "stm32_lpm.h"
#include "stm32_seq.h"
#if (CFG_USB_INTERFACE_ENABLE != 0)
#include "vcp.h"
#include "vcp_conf.h"
#endif /* (CFG_USB_INTERFACE_ENABLE != 0) */

/* Private includes -----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <string.h>

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private defines -----------------------------------------------------------*/
#define C_SIZE_CMD_STRING       256U
#define C_PANID                 0x1111U
#define C_CHANNEL_NB            14U

/* USER CODE BEGIN PD */
#define C_RESSOURCE             "adcconv"
#define COAP_PAYLOAD_LENGTH     7U
#define WAIT_TIMEOUT            (1 * 1000 * 1000 / CFG_TS_TICK_VAL) /**< 1s */
#ifndef OUTDOOR_DEVICE
#define LED_FLASH_TIME          (1000 * 1000 / CFG_TS_TICK_VAL / 5) /**< 0.2s */
#define VCP_BUFFER_SIZE         64U
#endif
/* USER CODE END PD */

/* Private macros ------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private function prototypes -----------------------------------------------*/
static void APP_THREAD_CheckWirelessFirmwareInfo(void);
static void APP_THREAD_DeviceConfig(void);
static void APP_THREAD_StateNotif(uint32_t NotifFlags, void *pContext);
static void APP_THREAD_TraceError(const char * pMess, uint32_t ErrCode);
#if (CFG_FULL_LOW_POWER == 0)
static void Send_CLI_To_M0(void);
#endif /* (CFG_FULL_LOW_POWER == 0) */
static void Send_CLI_Ack_For_OT(void);
static void HostTxCb( void );
static void Wait_Getting_Ack_From_M0(void);
static void Receive_Ack_From_M0(void);
static void Receive_Notification_From_M0(void);
#if (CFG_HW_LPUART1_ENABLED == 1)
extern void MX_LPUART1_UART_Init(void);
#endif
#if (CFG_HW_USART1_ENABLED == 1)
extern void MX_USART1_UART_Init(void);
#endif
#if (CFG_USB_INTERFACE_ENABLE != 0)
static uint32_t ProcessCmdString(uint8_t* buf , uint32_t len);
#else
#if (CFG_FULL_LOW_POWER == 0)
static void RxCpltCallback(void);
#endif /* (CFG_FULL_LOW_POWER == 0) */
#endif /* (CFG_USB_INTERFACE_ENABLE != 0) */

/* USER CODE BEGIN PFP */
static void APP_THREAD_CoapSendRequest(otCoapResource * aCoapRessource,
                                        otCoapType aCoapType,
                                        otCoapCode aCoapCode,
                                        const char * aStringAddress,
                                        const otIp6Address * aPeerAddress,
                                        uint8_t* aPayload,
                                        uint16_t Size,
                                        otCoapResponseHandler aHandler,
                                        void *aContext);

static void APP_THREAD_CoapRequestHandler(void * pContext,
                                          otMessage * pMessage,
                                          const otMessageInfo * pMessageInfo);

static void APP_THREAD_CoapSendDataResponse(otMessage * pMessage,
                                            const otMessageInfo * pMessageInfo);

static void APP_THREAD_CoapDataRespHandler(void * aContext,
                                           otMessage * pMessage,
                                           const otMessageInfo * pMessageInfo,
                                           otError result);

static void APP_THREAD_InitPayloadWrite(void);
static void APP_THREAD_InitPayloadRead(void);
static void APP_THREAD_SendCoapMsg(void);
static void APP_THREAD_TimingElapsed(void);
static void APP_THREAD_LedTimingElapsed(void);

static bool APP_THREAD_CheckMsgValidity(void);

/* USER CODE END PFP */

