rreicher/PNucleoWB55_Thread/Thread_Coap_Generic/STM32_WPAN/App/app_thread.c
      otCoapMessageInit(pOT_Message, aCoapType, aCoapCode);
      otCoapMessageAppendUriPathOptions(pOT_Message, aCoapRessource->mUriPath);
      otCoapMessageSetPayloadMarker(pOT_Message);

      if ((aPayload != NULL) && (Size > 0))
      {
        error = otMessageAppend(pOT_Message, aPayload, Size);
        if (error != OT_ERROR_NONE)
        {
          APP_THREAD_Error(ERR_THREAD_COAP_APPEND, error);
          break;
        }
      }
      else
      {
        APP_DBG("APP_THREAD_CoapSendRequest: No payload passed");
      }

      memset(&OT_MessageInfo, 0, sizeof(OT_MessageInfo));
      OT_MessageInfo.mPeerPort = OT_DEFAULT_COAP_PORT;

      if ((aPeerAddress == NULL) && (aStringAddress != NULL))
      {
        APP_DBG("Use String Address : %s ", aStringAddress);
        otIp6AddressFromString(aStringAddress, &OT_MessageInfo.mPeerAddr);
      }
      else
      {
        if (aPeerAddress != NULL)
        {
          APP_DBG("Use Peer Address");
          memcpy(&OT_MessageInfo.mPeerAddr, aPeerAddress, sizeof(OT_MessageInfo.mPeerAddr));
        }
        else
        {
          APP_DBG("ERROR: Address string and Peer Address not defined");
          APP_THREAD_Error(ERR_THREAD_COAP_ADDRESS_NOT_DEFINED, 0);
        }
      }

      if (aCoapType == OT_COAP_TYPE_NON_CONFIRMABLE)
      {
        APP_DBG("aCoapType == OT_COAP_TYPE_NON_CONFIRMABLE");
        error = otCoapSendRequest(NULL,
                                  pOT_Message,
                                  &OT_MessageInfo,
                                  NULL,
                                  NULL);
      }

      if (aCoapType == OT_COAP_TYPE_CONFIRMABLE)
      {
        APP_DBG("aCoapType == OT_COAP_TYPE_CONFIRMABLE");
        error = otCoapSendRequest(NULL,
                                  pOT_Message,
                                  &OT_MessageInfo,
                                  aHandler,
                                  aContext);
      }
    } while(false);

    if (error != OT_ERROR_NONE && pOT_Message != NULL)
    {
      otMessageFree(pOT_Message);
      APP_THREAD_Error(ERR_THREAD_COAP_SEND_REQUEST, error);
    }
    else
    {
#ifdef OUTDOOR_DEVICE
      /**> RR Coap message succefully send */
      CoapSend++;
#endif
  }
}

/**
 * @brief Handler called when the server receives a COAP request.
 *
 * @param pContext : Context
 * @param pHeader : Header
 * @param pMessage : Message
 * @param pMessageInfo : Message information
 * @retval None
 */
static void APP_THREAD_CoapRequestHandler(void * pContext,
                                          otMessage * pMessage,
                                          const otMessageInfo * pMessageInfo)
{
  APP_DBG(" Received CoAP request (context = %s)",pContext);
  /* USER CODE BEGIN APP_THREAD_CoapRequestHandler */
  if (otMessageRead(pMessage, otMessageGetOffset(pMessage), &PayloadRead, sizeof(PayloadRead)) != sizeof(PayloadRead))
  {
    APP_THREAD_Error(ERR_THREAD_MESSAGE_READ, 0);
  }

#ifndef OUTDOOR_DEVICE

  char vcpTxBuffer[VCP_BUFFER_SIZE];
  uint8_t buffLen;

  memset(vcpTxBuffer, 0, sizeof(vcpTxBuffer));

  /**> RR Serialize data in JSON format */
  buffLen = sprintf(vcpTxBuffer, "{\"adc_in0\": %d, \"adc_in1\": %d, \"adc_in2\": %d, \"ratio\": %d}\n\r",
                    PayloadRead[0] + (PayloadRead[1] << 8),
                    PayloadRead[2] + (PayloadRead[3] << 8),
                    PayloadRead[4] + (PayloadRead[5] << 8),
                    PayloadRead[6]);

  /**> RR Send it over UART */
  HAL_UART_Transmit_DMA(&huart1, (uint8_t *)vcpTxBuffer, buffLen);

  /**> Start Led Flashing timer 2x */
  BSP_LED_On(LED1);
  HW_TS_Start(TimerLED, (uint32_t)LED_FLASH_TIME);
  UTIL_SEQ_WaitEvt(LED_EVENT_TIMER);
  BSP_LED_Off(LED1);
#endif

  if (APP_THREAD_CheckMsgValidity() == true)
  {
    /**> RR to be implemented */
  }
  /* USER CODE END APP_THREAD_CoapRequestHandler */

  /* If Message is Confirmable, send response */
  if (otCoapMessageGetType(pMessage) == OT_COAP_TYPE_CONFIRMABLE)
  {
    APP_THREAD_CoapSendDataResponse(pMessage, pMessageInfo);
  }
}

/**
 * @brief This function acknowledges the data reception by sending an ACK
 *    back to the sender.
 * @param  pMessage coap message
 * @param  pMessageInfo message info pointer
 * @retval None
 */
static void APP_THREAD_CoapSendDataResponse(otMessage * pMessage,
                                            const otMessageInfo * pMessageInfo)
{
  otError  error = OT_ERROR_NONE;

  do{
    APP_DBG(" ********* APP_THREAD_CoapSendDataResponse ********* ");

    pOT_MessageResponse = otCoapNewMessage(NULL, NULL);
    if (pOT_MessageResponse == NULL)
    {
      APP_DBG("WARNING : pOT_MessageResponse = NULL ! -> exit now");
      break;
    }

    otCoapMessageInitResponse(pOT_MessageResponse,
                              pMessage,
                              OT_COAP_TYPE_ACKNOWLEDGMENT,
                              OT_COAP_CODE_VALID);

    error = otCoapSendResponse(NULL, pOT_MessageResponse, pMessageInfo);

    if (error != OT_ERROR_NONE && pOT_MessageResponse != NULL)
    {
      otMessageFree(pOT_MessageResponse);
      APP_THREAD_Error(ERR_THREAD_COAP_DATA_RESPONSE, error);
    }
  }while(false);
}

/**
 * @brief This function manages the data response handler.
 *
 * @param pHeader  context
 * @param pMessage message pointer
 * @param pMessageInfo message info pointer
 * @param result error code
 * @retval None
 */
static void APP_THREAD_CoapDataRespHandler(void * pContext,
                                           otMessage * pMessage,
                                           const otMessageInfo * pMessageInfo,
                                           otError result)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(pMessage);
  UNUSED(pMessageInfo);

  if (result == OT_ERROR_NONE)
  {
    APP_DBG("APP_THREAD_CoapDataRespHandler : NO ERROR");
#ifdef OUTDOOR_DEVICE
    /**> Coap data response ACK successfully received */
    CoapAck++;
    ackRatio = 100 * CoapAck / CoapSend;
#endif
  }
  else
  {
    APP_DBG("APP_THREAD_CoapDataRespHandler : WARNING Result = %d",result);
  }
}

/**
 * @brief Initialize CoAP write buffer.
 * @param  None
 * @retval None
 */
static void APP_THREAD_InitPayloadWrite(void)
{
  uint8_t i;
  for (i = 0; i < COAP_PAYLOAD_LENGTH; i++)
  {
    PayloadWrite[i] = 0x00;
  }
}

/**
 * @brief Initialize CoAP read buffer.
 * @param  None
 * @retval None
 */
static void APP_THREAD_InitPayloadRead(void)
{
  uint8_t i;
  for (i = 0; i < COAP_PAYLOAD_LENGTH; i++)
  {
    PayloadRead[i] = 0x00;
  }
}


/**
 * @brief Task associated to the push button.
 * @param  None
 * @retval None
 */
static void APP_THREAD_SendCoapMsg(void)
{
#ifdef OUTDOOR_DEVICE
  /**> RR Update Payload field */
  PayloadWrite[0] = (uint8_t)(adcIn1Raw & 0xFF);
  PayloadWrite[1] = (uint8_t)(adcIn1Raw >> 8);

  PayloadWrite[2] = (uint8_t)(adcIn2Raw & 0xFF);
  PayloadWrite[3] = (uint8_t)(adcIn2Raw >> 8);

